pmo-dataset/variations/graphviz_basic/05.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Conduct site visit" -> "ExclusiveGateway_1";
  "ExclusiveGateway_4" -> "ExclusiveGateway_1";
  "ExclusiveGateway_4" -> "Conduct interview";
  "ExclusiveGateway_2" -> "Select supplier";
  "Execute contract" -> "end";
  "Receive supplier proposals" -> "ExclusiveGateway_3";
  "start" -> "Identify need for new supplier or vendor";
  "ExclusiveGateway_3" -> "Evaluate proposal";
  "Conduct interview" -> "ExclusiveGateway_1";
  "Begin contract negotiations" -> "Sign contract";
  "ExclusiveGateway_4" -> "Conduct site visit";
  "ExclusiveGateway_1" -> "ExclusiveGateway_2";
  "Sign contract" -> "Onboard supplier";
  "Issue request for proposals (RFP)" -> "Receive supplier proposals";
  "Evaluate proposal" -> "ExclusiveGateway_4";
  "Onboard supplier" -> "Execute contract";
  "ExclusiveGateway_2" -> "ExclusiveGateway_3";
  "Select supplier" -> "Begin contract negotiations";
  "Identify need for new supplier or vendor" -> "Issue request for proposals (RFP)";

  "start" [shape=circle, label="start"];
  "end" [shape=circle, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
}
